#변수
hi='hello'
print(hi,'세상아')
print(hi,'하늘아')
# 변수는 여러 곳에서 간단하게 쓰기 위해서 만드는 것이다.
# =은 왼쪽의 이름에 오른쪽의 값을 대응시키주는 것이기 때문에
# 한번 정해진 변수는 언제든지 다시 바뀔 수 있다.


#주석
'''
여러 줄의 주석은 따옴표로 감싼다
주석은 어려운 코드에 설명을 적어두거나
잠깐 코드를 꺼두는 용도로 사용함
'''

#파이썬은 문자보다 숫자를 유용하게 사용한다
# ** 은 거듭제곱이다
# %는 나머지 기호이다.
#문자열끼리 + 하면, 문자열 두개가 이어져서 새 문자열이 나온다


'''
REPL(Read-Eval-Print Loop)
코드를 읽어서
읽은 코드를 평가(실행)하고
실행한 결과를 출력하는
루프(반복)
* 터미널 창에서 python만 입력하면 나오는
한 줄씩 파이썬 코드를 실행시키는 기능
간단한 코드 확인 시 사용하면 유용하다.
'''


'''
명령줄 셸(맥에서 터미널)은 운영체제가 사용자와 소통하는 기능이다.
pwd : Print Working Directory
현재 위치(현재 작업하고 있는 디렉토리)를 알려줌
명령줄 쉘에서는 폴더를 디렉토리라고 한다
pwd의 결과값은 그래픽 셸의 주소창에 있는 경로와 같다

ls : List Segment
폴더 안에 있는 폴더와 파일들의 목록을 보여줌

cd : Change Directory
디렉토리 이동 기능
.. 점 두개는 상위 폴더를 의미한다.

cp : Copy
cp 복사할파일명 새로운파일명

rm : Remove
파일 및 폴더 삭제
휴지통에 들어가거나 경고하지 않고 바로 삭제되므로 주의

파일 이름을 작성할 땐 앞 2~3 글자만 적고 탭을 누르면 자동완성된다.

'''

